# GetAllHandles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraintsManager..::..GetAllHandles Method
RebarConstraintsManager Class See Also
---
Gets all RebarConstrainedHandles of this bar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<RebarConstrainedHandle> GetAllHandles()
```

Visual Basic
---
```text
Public Function GetAllHandles As IList(Of RebarConstrainedHandle)
```

Visual C++
---
```text
public:
IList<RebarConstrainedHandle^>^ GetAllHandles()
```

# ### Return Value
All RebarConstrainedHandle objects will be returned, regardless of whether there are constraints associated to them.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The RebarConstraintsManager does not manage a valid Rebar element. |

# See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace